source/about/index.html
---
layout: page
title: "About Justin Gordon"
date: 2013-08-15 18:03
comments: false
sharing: true
footer: true
keywords: Rails, Justin Gordon, Consulting, Ruby on Rails, Maui
description: About the Rails on Maui website and Justin Gordon's background.
---
<p>
I have been passionately writing software since 1985, focusing on Java since
1996 at several startups and with Ruby on Rails since 2011. 
</p>

<p>
My consulting practice has grown. Here's the story: <a href="http://www.shakacode.com/2015/09/17/who-is-shaka-code.html">Who is ShakaCode?</a>
</p>

<p>
Please contact me at <a href="mailto:justin@shakacode.com">justin@shakacode.com</a> if you're interested in Rails
consulting. This blog is created using Octopress, as described <a href="../blog/2013/04/27/octopress-setup-with-github-and-org-mode/index.html">here</a>.
</p>

<blockquote>
<p>
"Would you bet on a NASCAR driver who can't drive stick? No? Then fire every
developer who doesn't use Vim or Emacs.", the "Hipster Hacker" on Twitter.
</p>
</blockquote>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">Links to Details</h2>
<div class="outline-text-2" id="text-orgheadline1">
<ul class="org-ul">
<li>I <del>like</del> love to program. Here's a narrative of <a href="about-justin-gordon-programming.html">Justin's years tinkering with computers</a>.</li>
<li><a href="justin-gordon-resume.html">My resume</a>.</li>
<li>I telecommute from Maui. <a href="telecommuting.html">Why telecommuting works and how I maximize productivity</a>.</li>
</ul>

<p>
{% img /about/Justin-Office-2013.JPG %}
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2">Some Bullets</h2>
<div class="outline-text-2" id="text-orgheadline2">
<ul class="org-ul">
<li>Rails projects: <a href="http://www.blinkinc.com/">http://www.blinkinc.com/</a> and a several other startups.</li>
<li>I use ideaVim inside of RubyMine and IntelliJ and Evil (vim) mode inside of
emacs. And almost everything I do is backed by developer written tests.
Recently, I switched to <a href="https://github.com/syl20bnr/spacemacs">Spacemacs</a>.</li>
<li>Experienced and passionate software engineer with a track record of successful projects.</li>
<li>Responsible for majority of design and coding of the core storage layer behind
the <a href="http://public.dhe.ibm.com/common/ssi/ecm/en/iml14344usen/IML14344USEN.PDF">Gartner 2012</a> leading program for product master data management:
<a href="http://www-01.ibm.com/software/data/infosphere/mdm/collaborative.html">InfoSphere MDM Collaborative Edition</a>. This involved tons of TDD along with
tons of experience optimizing Java code in Yourkit, and inventing clever time
and space solutions, including binary data stores and distributed caching.</li>
<li>Love programming in Ruby on Rails and the whole wonderful ecosystem of Heroku,
Amazon EC2, jQuery, coffeescript, haml, sass, etc.</li>
<li>Close connections to the Jetbrains team and expert with their tools: IntelliJ and RubyMine.</li>
<li>Love writing tests in rspec, and phantomjs with capybara is simply amazing.
Finally, developers can write tests on the full stack, including all client
side javascript.</li>
<li>Twitter Bootstrap rocks.</li>
<li>Previously specialized in Master Data Manager for Product Information Management.</li>
<li>Thought leader in doing Test Driven Development in the context of enterprise
software.</li>
<li>Author of open source project "Dependent Object Framework", which vastly
simplifies and accelerates JUnit testing with persistent dependencies.</li>
<li>Former speaker at Dr. Dobb's SD West Santa Clara, Architecture and Design
World Chicago, and SD Best Practices in Boston. Talks were on "JUnit and
Test-Driven Development: Why and How in Enterprise Software" and the
"Dependent Object Framework for Enterprise TDD".</li>
<li>Tons I didn't mention, but stuff you'd expect given my experience. Here's a
few more things I like using: postgres, tmux, yaml, json, rubygems (too many
to list), and the Canary's webkit debugger.</li>
<li>Graduated in 1991 with an AB magna cum laude in applied mathematics from
Harvard and received an MBA from UC Berkeley in 2001.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3">Outside of Programming</h2>
<div class="outline-text-2" id="text-orgheadline3">
<p>
Besides writing great software, Justin enjoys the ocean sports found in Maui,
and has done quite a bit of home improvement, having designed and built the
Sugar Ranch, a B&amp;B (pending application) where he lives with his family. You can
read more about Sugar Ranch here <a href="http://www.sugarranchmaui.com/">http://www.sugarranchmaui.com/</a> and here:
<a href="http://www.facebook.com/sugarranch">http://www.facebook.com/sugarranch</a>.
</p>


<p>
<a href="https://maps.google.com/maps?q=141+Makahiki+St,+Paia,+HI&amp;hl=en&amp;ll=20.908851,-156.408621&amp;spn=0.002944,0.003433&amp;sll=20.46,-157.505&amp;sspn=12.075058,9.876709&amp;oq=141&amp;t=w&amp;hnear=141+Makahiki+St,+Paia,+Maui,+Hawaii+96779&amp;z=19&amp;iwloc=r0&amp;source=gplus-ogsb">Map of Sugar Ranch</a>.
</p>

<p>
As you drive up to Sugar Ranch&#x2026;
{% img /about/SugarRanchFrontEvening.jpg %}
</p>

<p>
The back side of Sugar Ranch&#x2026;
{% img /about/SugarRanchRearEvening.jpg %}
</p>
</div>
</div>
